pkg/wsman/wsmantesting/responses/ips/ieee8021x/settings/get.xml

<?xml version="1.0" encoding="UTF-8"?>
<a:Envelope xmlns:a="http://www.w3.org/2003/05/soap-envelope"
    xmlns:b="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:c="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"
    xmlns:d="http://schemas.xmlsoap.org/ws/2005/02/trust"
    xmlns:e="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:f="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd"
    xmlns:g="http://intel.com/wbem/wscim/1/ips-schema/1/IPS_IEEE8021xSettings"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <a:Header>
        <b:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</b:To>
        <b:RelatesTo>14</b:RelatesTo>
        <b:Action a:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/GetResponse</b:Action>
        <b:MessageID>uuid:00000000-8086-8086-8086-0000000032FB</b:MessageID>
        <c:ResourceURI>http://intel.com/wbem/wscim/1/ips-schema/1/IPS_IEEE8021xSettings</c:ResourceURI>
    </a:Header>
    <a:Body>
        <g:IPS_IEEE8021xSettings>
            <g:AvailableInS0>false</g:AvailableInS0>
            <g:ElementName>Intel(r) AMT: 8021X Settings</g:ElementName>
            <g:Enabled>3</g:Enabled>
            <g:InstanceID>Intel(r) AMT: 8021X Settings</g:InstanceID>
            <g:PxeTimeout>120</g:PxeTimeout>
        </g:IPS_IEEE8021xSettings>
    </a:Body>
</a:Envelope>